Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_iot_central_bg96/Secure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/nvmctrl.h
#define NVMCTRL_SECCTRL_TAMPEEN_Pos           _UINT32_(0)                                          /* (NVMCTRL_SECCTRL) Tamper Erase Enable Position */
#define NVMCTRL_SECCTRL_TAMPEEN_Msk           (_UINT32_(0x1) << NVMCTRL_SECCTRL_TAMPEEN_Pos)       /* (NVMCTRL_SECCTRL) Tamper Erase Enable Mask */
#define NVMCTRL_SECCTRL_TAMPEEN(value)        (NVMCTRL_SECCTRL_TAMPEEN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_TAMPEEN_Pos)) /* Assigment of value for TAMPEEN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_SILACC_Pos            _UINT32_(2)                                          /* (NVMCTRL_SECCTRL) Silent Access Position */
#define NVMCTRL_SECCTRL_SILACC_Msk            (_UINT32_(0x1) << NVMCTRL_SECCTRL_SILACC_Pos)        /* (NVMCTRL_SECCTRL) Silent Access Mask */
#define NVMCTRL_SECCTRL_SILACC(value)         (NVMCTRL_SECCTRL_SILACC_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_SILACC_Pos)) /* Assigment of value for SILACC in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_DSCEN_Pos             _UINT32_(3)                                          /* (NVMCTRL_SECCTRL) Data Scramble Enable Position */
#define NVMCTRL_SECCTRL_DSCEN_Msk             (_UINT32_(0x1) << NVMCTRL_SECCTRL_DSCEN_Pos)         /* (NVMCTRL_SECCTRL) Data Scramble Enable Mask */
#define NVMCTRL_SECCTRL_DSCEN(value)          (NVMCTRL_SECCTRL_DSCEN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_DSCEN_Pos)) /* Assigment of value for DSCEN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_SCFGWEN_Pos           _UINT32_(4)                                          /* (NVMCTRL_SECCTRL) Security Configuration Write Enable Position */
#define NVMCTRL_SECCTRL_SCFGWEN_Msk           (_UINT32_(0x1) << NVMCTRL_SECCTRL_SCFGWEN_Pos)       /* (NVMCTRL_SECCTRL) Security Configuration Write Enable Mask */
#define NVMCTRL_SECCTRL_SCFGWEN(value)        (NVMCTRL_SECCTRL_SCFGWEN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_SCFGWEN_Pos)) /* Assigment of value for SCFGWEN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_DALUN_Pos             _UINT32_(5)                                          /* (NVMCTRL_SECCTRL) DAL unlock Position */
#define NVMCTRL_SECCTRL_DALUN_Msk             (_UINT32_(0x1) << NVMCTRL_SECCTRL_DALUN_Pos)         /* (NVMCTRL_SECCTRL) DAL unlock Mask */
#define NVMCTRL_SECCTRL_DALUN(value)          (NVMCTRL_SECCTRL_DALUN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_DALUN_Pos)) /* Assigment of value for DALUN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_DXN_Pos               _UINT32_(6)                                          /* (NVMCTRL_SECCTRL) Data Flash is eXecute Never Position */
#define NVMCTRL_SECCTRL_DXN_Msk               (_UINT32_(0x1) << NVMCTRL_SECCTRL_DXN_Pos)           /* (NVMCTRL_SECCTRL) Data Flash is eXecute Never Mask */
#define NVMCTRL_SECCTRL_DXN(value)            (NVMCTRL_SECCTRL_DXN_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_DXN_Pos)) /* Assigment of value for DXN in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_TEROW_Pos             _UINT32_(8)                                          /* (NVMCTRL_SECCTRL) Tamper Rease Row Position */
#define NVMCTRL_SECCTRL_TEROW_Msk             (_UINT32_(0x7) << NVMCTRL_SECCTRL_TEROW_Pos)         /* (NVMCTRL_SECCTRL) Tamper Rease Row Mask */
#define NVMCTRL_SECCTRL_TEROW(value)          (NVMCTRL_SECCTRL_TEROW_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_TEROW_Pos)) /* Assigment of value for TEROW in the NVMCTRL_SECCTRL register */
#define NVMCTRL_SECCTRL_KEY_Pos               _UINT32_(24)                                         /* (NVMCTRL_SECCTRL) Write Key Position */
#define NVMCTRL_SECCTRL_KEY_Msk               (_UINT32_(0xFF) << NVMCTRL_SECCTRL_KEY_Pos)          /* (NVMCTRL_SECCTRL) Write Key Mask */
#define NVMCTRL_SECCTRL_KEY(value)            (NVMCTRL_SECCTRL_KEY_Msk & (_UINT32_(value) << NVMCTRL_SECCTRL_KEY_Pos)) /* Assigment of value for KEY in the NVMCTRL_SECCTRL register */
#define   NVMCTRL_SECCTRL_KEY_KEY_Val         _UINT32_(0xA5)                                       /* (NVMCTRL_SECCTRL) Write Key  */
#define NVMCTRL_SECCTRL_KEY_KEY               (NVMCTRL_SECCTRL_KEY_KEY_Val << NVMCTRL_SECCTRL_KEY_Pos) /* (NVMCTRL_SECCTRL) Write Key Position  */
#define NVMCTRL_SECCTRL_Msk                   _UINT32_(0xFF00077D)                                 /* (NVMCTRL_SECCTRL) Register Mask  */


/* -------- NVMCTRL_SCFGB : (NVMCTRL Offset: 0x38) (R/W 32) Secure Boot Configuration -------- */
#define NVMCTRL_SCFGB_RESETVALUE              _UINT32_(0x03)                                       /*  (NVMCTRL_SCFGB) Secure Boot Configuration  Reset Value */

#define NVMCTRL_SCFGB_BCREN_Pos               _UINT32_(0)                                          /* (NVMCTRL_SCFGB) Boot Configuration Row Read Enable Position */
#define NVMCTRL_SCFGB_BCREN_Msk               (_UINT32_(0x1) << NVMCTRL_SCFGB_BCREN_Pos)           /* (NVMCTRL_SCFGB) Boot Configuration Row Read Enable Mask */
#define NVMCTRL_SCFGB_BCREN(value)            (NVMCTRL_SCFGB_BCREN_Msk & (_UINT32_(value) << NVMCTRL_SCFGB_BCREN_Pos)) /* Assigment of value for BCREN in the NVMCTRL_SCFGB register */
#define NVMCTRL_SCFGB_BCWEN_Pos               _UINT32_(1)                                          /* (NVMCTRL_SCFGB) Boot Configuration Row Write Enable Position */
#define NVMCTRL_SCFGB_BCWEN_Msk               (_UINT32_(0x1) << NVMCTRL_SCFGB_BCWEN_Pos)           /* (NVMCTRL_SCFGB) Boot Configuration Row Write Enable Mask */
#define NVMCTRL_SCFGB_BCWEN(value)            (NVMCTRL_SCFGB_BCWEN_Msk & (_UINT32_(value) << NVMCTRL_SCFGB_BCWEN_Pos)) /* Assigment of value for BCWEN in the NVMCTRL_SCFGB register */
#define NVMCTRL_SCFGB_Msk                     _UINT32_(0x00000003)                                 /* (NVMCTRL_SCFGB) Register Mask  */


/* -------- NVMCTRL_SCFGAD : (NVMCTRL Offset: 0x3C) (R/W 32) Secure Application and Data Configuration -------- */
#define NVMCTRL_SCFGAD_RESETVALUE             _UINT32_(0x01)                                       /*  (NVMCTRL_SCFGAD) Secure Application and Data Configuration  Reset Value */

#define NVMCTRL_SCFGAD_URWEN_Pos              _UINT32_(0)                                          /* (NVMCTRL_SCFGAD) User Row Write Enable Position */
#define NVMCTRL_SCFGAD_URWEN_Msk              (_UINT32_(0x1) << NVMCTRL_SCFGAD_URWEN_Pos)          /* (NVMCTRL_SCFGAD) User Row Write Enable Mask */
#define NVMCTRL_SCFGAD_URWEN(value)           (NVMCTRL_SCFGAD_URWEN_Msk & (_UINT32_(value) << NVMCTRL_SCFGAD_URWEN_Pos)) /* Assigment of value for URWEN in the NVMCTRL_SCFGAD register */
#define NVMCTRL_SCFGAD_Msk                    _UINT32_(0x00000001)                                 /* (NVMCTRL_SCFGAD) Register Mask  */


/* -------- NVMCTRL_NONSEC : (NVMCTRL Offset: 0x40) (R/W 32) Non-secure Write Enable -------- */
#define NVMCTRL_NONSEC_RESETVALUE             _UINT32_(0x01)                                       /*  (NVMCTRL_NONSEC) Non-secure Write Enable  Reset Value */

#define NVMCTRL_NONSEC_WRITE_Pos              _UINT32_(0)                                          /* (NVMCTRL_NONSEC) Non-secure APB alias write enable, non-secure AHB writes to non-secure regions enable Position */
#define NVMCTRL_NONSEC_WRITE_Msk              (_UINT32_(0x1) << NVMCTRL_NONSEC_WRITE_Pos)          /* (NVMCTRL_NONSEC) Non-secure APB alias write enable, non-secure AHB writes to non-secure regions enable Mask */
#define NVMCTRL_NONSEC_WRITE(value)           (NVMCTRL_NONSEC_WRITE_Msk & (_UINT32_(value) << NVMCTRL_NONSEC_WRITE_Pos)) /* Assigment of value for WRITE in the NVMCTRL_NONSEC register */
#define NVMCTRL_NONSEC_Msk                    _UINT32_(0x00000001)                                 /* (NVMCTRL_NONSEC) Register Mask  */


